In [9]:
import pandas as pd

In [10]:
import numpy as np

In [33]:
df = pd.read_csv("Book2.csv")

In [34]:
df

        numbers                                               Text
0  4.757870e+52  4757874684687687684687684568746876846878768768...
1  8.790000e+52  8789447878465745468796476854768746578646854867...
2  4.890000e+52  4894564564351321654984564564684351351564564354...

In [29]:
df.numbers.astype(str)

0                 4.76e+52
1                 8.79e+52
2    4.894560000000001e+52
Name: numbers, dtype: object

In [35]:
df.numbers.apply(lambda x: '{:f}'.format(x))

0    4757870000000000369598362754980725596646819208...
1    8790000000000000259426857836018519410012111671...
2    4890000000000000285865158006008170301811448748...
Name: numbers, dtype: object

In [47]:
ser = df.Text.astype(float)

In [43]:
df.Text.astype(float).apply(lambda x: '{:f}'.format(x))

0    4757874684687687743714483293811516811527492604...
1    8789447878465745545774255578845285798908764714...
2    4894564564351321171205516653221418873323958361...
Name: Text, dtype: object

In [48]:
ser.apply(lambda x: '{:f}'.format(x))

0    4757874684687687743714483293811516811527492604...
1    8789447878465745545774255578845285798908764714...
2    4894564564351321171205516653221418873323958361...
Name: Text, dtype: object

In [49]:

df1 = pd.read_csv("C:/Users/rajen/OneDrive/Desktop/webScraping/moneycontro_balancesheet_itc.csv")

In [50]:
df1

,Unnamed: 0,Balance Sheet of ITC (in Rs. Cr.),Mar 22,Mar 21,Mar 20,Mar 19,Mar 18,
0,0,,12 mths,12 mths,12 mths,12 mths,12 mths,
1,1,EQUITIES AND LIABILITIES,NaN,NaN,NaN,NaN,NaN,
2,2,SHAREHOLDER'S FUNDS,NaN,NaN,NaN,NaN,NaN,
3,3,Equity Share Capital,"1,232.33","1,230.88","1,229.22","1,225.86","1,220.43",
4,4,Total Share Capital,"1,232.33","1,230.88","1,229.22","1,225.86","1,220.43",
...,...,...,...,...,...,...,...,...
60,60,Non-Current Investments Quoted Market Value,"11,205.72","9,984.03","10,592.71","11,218.74","11,096.58",
61,61,Non-Current Investments Unquoted Book Value,"4,705.95","3,465.92","3,091.69","2,882.13","2,432.64",
62,62,CURRENT INVESTMENTS,NaN,NaN,NaN,NaN,NaN,
63,63,Current Investments Quoted Market Value,"4,483.77","4,302.03","3,122.85","4,624.25","1,792.59",
64,64,Current Investments Unquoted Book Value,"7,157.66","9,774.63","14,061.11","7,885.76","8,111.65",